Build Model
modifying input layer to accept 11 channels
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 160, 160]          34,496
         GroupNorm-2         [-1, 64, 160, 160]             128
              ReLU-3         [-1, 64, 160, 160]               0
         MaxPool2d-4  [[-1, 64, 80, 80], [-1, 64, 80, 80]]               0
            Conv2d-5           [-1, 64, 80, 80]           4,096
         GroupNorm-6           [-1, 64, 80, 80]             128
              ReLU-7           [-1, 64, 80, 80]               0
            Conv2d-8           [-1, 64, 80, 80]          36,864
         GroupNorm-9           [-1, 64, 80, 80]             128
             ReLU-10           [-1, 64, 80, 80]               0
           Conv2d-11          [-1, 256, 80, 80]          16,384
        GroupNorm-12          [-1, 256, 80, 80]             512
           Conv2d-13          [-1, 256, 80, 80]          16,384
        GroupNorm-14          [-1, 256, 80, 80]             512
             ReLU-15          [-1, 256, 80, 80]               0
       Bottleneck-16          [-1, 256, 80, 80]               0
           Conv2d-17           [-1, 64, 80, 80]          16,384
        GroupNorm-18           [-1, 64, 80, 80]             128
             ReLU-19           [-1, 64, 80, 80]               0
           Conv2d-20           [-1, 64, 80, 80]          36,864
        GroupNorm-21           [-1, 64, 80, 80]             128
             ReLU-22           [-1, 64, 80, 80]               0
           Conv2d-23          [-1, 256, 80, 80]          16,384
        GroupNorm-24          [-1, 256, 80, 80]             512
             ReLU-25          [-1, 256, 80, 80]               0
       Bottleneck-26          [-1, 256, 80, 80]               0
           Conv2d-27           [-1, 64, 80, 80]          16,384
        GroupNorm-28           [-1, 64, 80, 80]             128
             ReLU-29           [-1, 64, 80, 80]               0
           Conv2d-30           [-1, 64, 80, 80]          36,864
        GroupNorm-31           [-1, 64, 80, 80]             128
             ReLU-32           [-1, 64, 80, 80]               0
           Conv2d-33          [-1, 256, 80, 80]          16,384
        GroupNorm-34          [-1, 256, 80, 80]             512
             ReLU-35          [-1, 256, 80, 80]               0
       Bottleneck-36          [-1, 256, 80, 80]               0
           Conv2d-37          [-1, 128, 80, 80]          32,768
        GroupNorm-38          [-1, 128, 80, 80]             256
             ReLU-39          [-1, 128, 80, 80]               0
           Conv2d-40          [-1, 128, 40, 40]         147,456
        GroupNorm-41          [-1, 128, 40, 40]             256
             ReLU-42          [-1, 128, 40, 40]               0
           Conv2d-43          [-1, 512, 40, 40]          65,536
        GroupNorm-44          [-1, 512, 40, 40]           1,024
           Conv2d-45          [-1, 512, 40, 40]         131,072
        GroupNorm-46          [-1, 512, 40, 40]           1,024
             ReLU-47          [-1, 512, 40, 40]               0
       Bottleneck-48          [-1, 512, 40, 40]               0
           Conv2d-49          [-1, 128, 40, 40]          65,536
        GroupNorm-50          [-1, 128, 40, 40]             256
             ReLU-51          [-1, 128, 40, 40]               0
           Conv2d-52          [-1, 128, 40, 40]         147,456
        GroupNorm-53          [-1, 128, 40, 40]             256
             ReLU-54          [-1, 128, 40, 40]               0
           Conv2d-55          [-1, 512, 40, 40]          65,536
        GroupNorm-56          [-1, 512, 40, 40]           1,024
             ReLU-57          [-1, 512, 40, 40]               0
       Bottleneck-58          [-1, 512, 40, 40]               0
           Conv2d-59          [-1, 128, 40, 40]          65,536
        GroupNorm-60          [-1, 128, 40, 40]             256
             ReLU-61          [-1, 128, 40, 40]               0
           Conv2d-62          [-1, 128, 40, 40]         147,456
        GroupNorm-63          [-1, 128, 40, 40]             256
             ReLU-64          [-1, 128, 40, 40]               0
           Conv2d-65          [-1, 512, 40, 40]          65,536
        GroupNorm-66          [-1, 512, 40, 40]           1,024
             ReLU-67          [-1, 512, 40, 40]               0
       Bottleneck-68          [-1, 512, 40, 40]               0
           Conv2d-69          [-1, 128, 40, 40]          65,536
        GroupNorm-70          [-1, 128, 40, 40]             256
             ReLU-71          [-1, 128, 40, 40]               0
           Conv2d-72          [-1, 128, 40, 40]         147,456
        GroupNorm-73          [-1, 128, 40, 40]             256
             ReLU-74          [-1, 128, 40, 40]               0
           Conv2d-75          [-1, 512, 40, 40]          65,536
        GroupNorm-76          [-1, 512, 40, 40]           1,024
             ReLU-77          [-1, 512, 40, 40]               0
       Bottleneck-78          [-1, 512, 40, 40]               0
           Conv2d-79          [-1, 256, 40, 40]         131,072
        GroupNorm-80          [-1, 256, 40, 40]             512
             ReLU-81          [-1, 256, 40, 40]               0
           Conv2d-82          [-1, 256, 40, 40]         589,824
        GroupNorm-83          [-1, 256, 40, 40]             512
             ReLU-84          [-1, 256, 40, 40]               0
           Conv2d-85         [-1, 1024, 40, 40]         262,144
        GroupNorm-86         [-1, 1024, 40, 40]           2,048
           Conv2d-87         [-1, 1024, 40, 40]         524,288
        GroupNorm-88         [-1, 1024, 40, 40]           2,048
             ReLU-89         [-1, 1024, 40, 40]               0
       Bottleneck-90         [-1, 1024, 40, 40]               0
           Conv2d-91          [-1, 256, 40, 40]         262,144
        GroupNorm-92          [-1, 256, 40, 40]             512
             ReLU-93          [-1, 256, 40, 40]               0
           Conv2d-94          [-1, 256, 40, 40]         589,824
        GroupNorm-95          [-1, 256, 40, 40]             512
             ReLU-96          [-1, 256, 40, 40]               0
           Conv2d-97         [-1, 1024, 40, 40]         262,144
        GroupNorm-98         [-1, 1024, 40, 40]           2,048
             ReLU-99         [-1, 1024, 40, 40]               0
      Bottleneck-100         [-1, 1024, 40, 40]               0
          Conv2d-101          [-1, 256, 40, 40]         262,144
       GroupNorm-102          [-1, 256, 40, 40]             512
            ReLU-103          [-1, 256, 40, 40]               0
          Conv2d-104          [-1, 256, 40, 40]         589,824
       GroupNorm-105          [-1, 256, 40, 40]             512
            ReLU-106          [-1, 256, 40, 40]               0
          Conv2d-107         [-1, 1024, 40, 40]         262,144
       GroupNorm-108         [-1, 1024, 40, 40]           2,048
            ReLU-109         [-1, 1024, 40, 40]               0
      Bottleneck-110         [-1, 1024, 40, 40]               0
          Conv2d-111          [-1, 256, 40, 40]         262,144
       GroupNorm-112          [-1, 256, 40, 40]             512
            ReLU-113          [-1, 256, 40, 40]               0
          Conv2d-114          [-1, 256, 40, 40]         589,824
       GroupNorm-115          [-1, 256, 40, 40]             512
            ReLU-116          [-1, 256, 40, 40]               0
          Conv2d-117         [-1, 1024, 40, 40]         262,144
       GroupNorm-118         [-1, 1024, 40, 40]           2,048
            ReLU-119         [-1, 1024, 40, 40]               0
      Bottleneck-120         [-1, 1024, 40, 40]               0
          Conv2d-121          [-1, 256, 40, 40]         262,144
       GroupNorm-122          [-1, 256, 40, 40]             512
            ReLU-123          [-1, 256, 40, 40]               0
          Conv2d-124          [-1, 256, 40, 40]         589,824
       GroupNorm-125          [-1, 256, 40, 40]             512
            ReLU-126          [-1, 256, 40, 40]               0
          Conv2d-127         [-1, 1024, 40, 40]         262,144
       GroupNorm-128         [-1, 1024, 40, 40]           2,048
            ReLU-129         [-1, 1024, 40, 40]               0
      Bottleneck-130         [-1, 1024, 40, 40]               0
          Conv2d-131          [-1, 256, 40, 40]         262,144
       GroupNorm-132          [-1, 256, 40, 40]             512
            ReLU-133          [-1, 256, 40, 40]               0
          Conv2d-134          [-1, 256, 40, 40]         589,824
       GroupNorm-135          [-1, 256, 40, 40]             512
            ReLU-136          [-1, 256, 40, 40]               0
          Conv2d-137         [-1, 1024, 40, 40]         262,144
       GroupNorm-138         [-1, 1024, 40, 40]           2,048
            ReLU-139         [-1, 1024, 40, 40]               0
      Bottleneck-140         [-1, 1024, 40, 40]               0
          Conv2d-141          [-1, 512, 40, 40]         524,288
       GroupNorm-142          [-1, 512, 40, 40]           1,024
            ReLU-143          [-1, 512, 40, 40]               0
          Conv2d-144          [-1, 512, 40, 40]       2,359,296
       GroupNorm-145          [-1, 512, 40, 40]           1,024
            ReLU-146          [-1, 512, 40, 40]               0
          Conv2d-147         [-1, 2048, 40, 40]       1,048,576
       GroupNorm-148         [-1, 2048, 40, 40]           4,096
          Conv2d-149         [-1, 2048, 40, 40]       2,097,152
       GroupNorm-150         [-1, 2048, 40, 40]           4,096
            ReLU-151         [-1, 2048, 40, 40]               0
      Bottleneck-152         [-1, 2048, 40, 40]               0
          Conv2d-153          [-1, 512, 40, 40]       1,048,576
       GroupNorm-154          [-1, 512, 40, 40]           1,024
            ReLU-155          [-1, 512, 40, 40]               0
          Conv2d-156          [-1, 512, 40, 40]       2,359,296
       GroupNorm-157          [-1, 512, 40, 40]           1,024
            ReLU-158          [-1, 512, 40, 40]               0
          Conv2d-159         [-1, 2048, 40, 40]       1,048,576
       GroupNorm-160         [-1, 2048, 40, 40]           4,096
            ReLU-161         [-1, 2048, 40, 40]               0
      Bottleneck-162         [-1, 2048, 40, 40]               0
          Conv2d-163          [-1, 512, 40, 40]       1,048,576
       GroupNorm-164          [-1, 512, 40, 40]           1,024
            ReLU-165          [-1, 512, 40, 40]               0
          Conv2d-166          [-1, 512, 40, 40]       2,359,296
       GroupNorm-167          [-1, 512, 40, 40]           1,024
            ReLU-168          [-1, 512, 40, 40]               0
          Conv2d-169         [-1, 2048, 40, 40]       1,048,576
       GroupNorm-170         [-1, 2048, 40, 40]           4,096
            ReLU-171         [-1, 2048, 40, 40]               0
      Bottleneck-172         [-1, 2048, 40, 40]               0
================================================================
Total params: 23,533,120
Trainable params: 23,533,120
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 4.30
Forward/backward pass size (MB): 1278667.19
Params size (MB): 89.77
Estimated Total Size (MB): 1278761.26
----------------------------------------------------------------
